package com.test007;

public class Sample {

	//메소드(Method)
	/*
	객체의 행동적 특성을 코드로 표현
	행동적 특성 한 개를 하나의 메소드로 표현할 것.
	예를 들어, 더하기 액션을 메소드로 만드는 경우
	그 안에는 더하기 연산을 수행하는 코드만 표현한다.
	*/
	
	//메소드 선언 형식
	/*
	접근제한자 반환자료형 메소드이름(매개변수) {
		//실행 코드
		//return 반환값;
	}
	*/
	
	//접근지정자(접근제한자)는 주로 public 지정. 외부에서 해당 메소드를 어떤 위치(클래스 내부, 클래스 외부, 패키지 내부, 패키지 외부)에서든지 접근 가능하다는 것을 지정하는 키워드.
	//반환자료형은 기본자료형, 참조자료형 모두 사용할 수 있다. 그외에 void라는 키워드를 사용할 수 있다. 기본자료형, 참조자료형을 사용하는 경우는 메소드 실행의 결과값을 반환할 때 사용될 자료형으로 지정된다. 외부에서 메소드 호출시 반환되는 값을 미리 예상할 수 있도록 하는 역할. void는 반환값이 없는 메소드를 작성할 때 사용한다. 
	//반환값이 있는 메소드인 경우는 메소드의 마지막 문장으로 return 반환값; 구문이 존재해야 한다.
	
	
}

