package com.test;

// 사용자 정의 자료형 - 클래스
public class Employee {

	
	//클래스 선언
	/*
	- 클래스 이름은 첫 글자를 대문자로 지정하고, 식별자 작성 규칙을 따른다.
	- '$', '_' 외의 특수 문자는 사용할 수 없다.
	- 클래스 범위는 { } 로 표기.
	- 클래스 내부에는 멤버를 자유롭게 구성. 단, 멤버변수(field), 메소드(일반, getter, setter,  생성자)로만 구성된다. 갯수는 상관없다.
	- 멤버변수(field)는 클래스의 객체(instance) 상태(state)를 저장할 때 사용. 속성으로 표현되기도 한다.
	- 메소드는 클래스의 기능(behavior)을 구현할 때 사용. 특수 목적으로 setter, getter, 생성자 메소드가 있다.
	- 접근지정자(접근제어자)는 주로 public 를 사용하거나, 생략하는 경우만 있다. public를 사용하는 경우는 독립적인 물리적 저장이 가능한 상태이고, 외부에서 해당 클래스를 접근할 수 있다는 의미이다. 생략하는 경우는 독립적인 물리적 저장은 가능하지만, 외부에서 접근이 제한된다. 
	- 물리적 .java 파일은 하나의 클래스만 존재하는 경우가 일반적이지만 물리적 .java 파일 하나 안에 두 개 이상의 클래스가 존재할 수 있다. 이때는 물리적 파일명과 같은 이름을 가진 클래스가 존재해야 하고, public 접근지정자가 붙어 있어야 한다. 다른 클래스는 접근지정자를 붙일 수 없다.
	- 클래스는 서로 독립적인 상태이므로 필요시 다른 클래스의 객체를 생성해서 사용할 수 있다. 클래스의 객체가 생성된 후에는 해당 클래스의 접근 가능한 멤버를 사용할 수 있다.
	*/
}
