package com.test021;

import java.util.*;

public class Main {

	public static void main(String[] args) {

		// 2차원 배열 초기화 및 출력
		/*
		 * 실행예) 2차원 배열 초기화 및 출력** 1.수평 2.수직 3.수평-좌우 4.수평-상하 5.달팽이 6.종료 선택>1 [1, 2, 3, 4,
		 * 5] [6, 7, 8, 9, 10] [11, 12, 13, 14, 15] [16, 17, 18, 19, 20] [21, 22, 23,
		 * 24, 25] 1.수평 2.수직 3.수평-좌우 4.수평-상하 5.달팽이 6.종료 선택>2 [1, 6, 11, 16, 21] [2, 7,
		 * 12, 17, 22] [3, 8, 13, 18, 23] [4, 9, 14, 19, 24] [5, 10, 15, 20, 25] 1.수평
		 * 2.수직 3.수평-좌우 4.수평-상하 5.달팽이 6.종료 선택>3 [1, 2, 3, 4, 5] [10, 9, 8, 7, 6] [11,
		 * 12, 13, 14, 15] [20, 19, 18, 17, 16] [21, 22, 23, 24, 25] 1.수평 2.수직 3.수평-좌우
		 * 4.수평-상하 5.달팽이 6.종료 선택>4 [1, 10, 11, 20, 21] [2, 9, 12, 19, 22] [3, 8, 13, 18,
		 * 23] [4, 7, 14, 17, 24] [5, 6, 15, 16, 25] 1.수평 2.수직 3.수평-좌우 4.수평-상하 5.달팽이
		 * 6.종료 선택>5 [1, 2, 3, 4, 5] [16, 17, 18, 19, 6] [15, 24, 25, 20, 7] [14, 23,
		 * 22, 21, 8] [13, 12, 11, 10, 9] 1.수평 2.수직 3.수평-좌우 4.수평-상하 5.달팽이 6.종료 선택>6 프로그램
		 * 종료
		 */

		Scanner sc = new Scanner(System.in);
		Test t = new Test();

		while (true) {
			System.out.println("1.수평  2.수직  3.수평-좌우  4.수평-상하  5.달팽이  6.종료");
			System.out.print("선택> ");

			int selectNo = sc.nextInt();
			sc.nextLine();

			if (selectNo == 6)
				break;

			switch (selectNo) {
			case 1:	t.method1(); break;
			case 2: t.method2(); break;
			case 3: t.method3(); break;
			case 4: t.method4(); break;
			case 5: t.method5(); break;
			default: break;
			}
		}

		sc.close();
		System.out.println("프로그램 종료");
	}

}
